Tekla.Structures.Drawing.ColorSelection
This class provides methods to show the color palette for drawing colors and hatch background colors.

Tekla.Structures.Drawing.ColorSelection.ShowColorPalette(Tekla.Structures.Drawing.TeklaDrawingColor,System.Nullable{System.IntPtr})
Shows the color palette for drawing colors.
color: The initial color
hWndOwner: (Optional) The window handle of the owner window. If not provided, uses the main window handle of the current process.
Returns: The selected color

Tekla.Structures.Drawing.ColorSelection.ShowColorPaletteForHatchBackground(Tekla.Structures.Drawing.TeklaDrawingColor,System.Nullable{System.IntPtr})
Shows the color palette for hatch background colors.
color: The initial color
hWndOwner: (Optional) The window handle of the owner window. If not provided, uses the main window handle of the current process.
Returns: The selected color